<?php

use Illuminate\Database\Seeder;
use \App\Award;
use \App\Goods;
use \App\Lottery;
use \App\User;
class MallSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $biglottery = ['一等奖_耳机'=>['BEATS新版solo2头戴式耳机耳麦',2250000],//名称，积分(参与人次)
            '二等奖_小米电源'=>['小米新款移动电源10000mAh 银色',103500],
            '二等奖_小米手环'=>['小米手环',103500],
            '二等奖_健康秤'=>['云康宝智能脂肪秤 蓝牙体脂仪',148000],
            '二等奖_润唇膏'=>['日本蝶翠诗（DHC）橄榄润唇膏',105000],
            '三等奖_自拍杆'=>['美逸线控自拍杆/自拍神器/迷你自拍器 太空蓝',28000],
            '三等奖_猪肉脯'=>['[百草味]靖江猪肉脯180g',33000],
            '三等奖_碧根果'=>['[百草味] 奶香碧根果218g',34000],
            '三等奖_巧克力'=>['amovo魔吻纯可可脂核桃伽纳彻',50000],


        ];


        $goods = [
            '三等奖_自拍杆'=>['美逸线控自拍杆/自拍神器/迷你自拍器 太空蓝',3,28500],
            '四等奖_焦糖咖啡'=>['雀巢（Nestle） 咖啡焦糖拿铁 100g',4,23000],
            '四等奖_辣条'=>['辣条',1,32850],
            '四等奖_麦吉士'=>['麦吉士图层酥塔',6,13500],
            '四等奖_摩卡咖啡'=>['Nestle雀巢咖啡摩卡咖啡条装105g',3,23000],

            '五等奖_旺仔牛奶苹果味'=>['旺旺 旺仔牛奶 苹果 (铁罐装) 245ml',5,6000],
            '五等奖_旺仔牛奶原味'=>['旺仔牛奶 原味(铁罐装) 245ml',6,6000],
            '五等奖_旺仔牛奶果汁味'=>['旺旺 旺仔牛奶 果汁味 (铁罐装) 245ml',5,6000],
            '五等奖_指甲刀'=>['简约时尚纯色折叠指甲钳',3,6750],
            '五等奖_包包'=>['可爱颜文字小钱包',5,7500],
            '五等奖_台历'=>['2016年田园风小清新年历计划本',3,7500],
            '五等奖_饭票'=>['儒林餐厅餐票',30,4500],

            '六等奖_便签本'=>['可爱喵星人N次贴',3,2250],
            '六等奖_裁纸刀'=>['迷你便携小号美工刀 快递开箱器',3,2700],
            '六等奖_彩色铅笔'=>['马可四色彩芯彩虹原木粗铅笔',5,2700],
            '六等奖_记事本'=>['简约纯色记事本',3,2250],
            '六等奖_键盘刷'=>['长柄键盘清洁刷',5,4500],
            '六等奖_搅拌勺'=>['不锈钢长柄搅拌勺',5,3750],
            '六等奖_沐浴球'=>['糖果色海绵沐浴花 ',3,2250],
            '六等奖_暖宝宝'=>['暖宝宝发热贴',5,750],
            '六等奖_贴纸'=>['可爱动物N次贴',3,3750],
            '六等奖_文件袋'=>['可爱A4试卷文件袋',4,3750],
            '六等奖_荧光笔'=>['彩色磨砂荧光笔记号',3,3300],
            '六等奖_自动笔'=>['创意多功能复合笔：圆珠笔+自动铅笔一体笔',3,2700],

        ];

        $lottery = [
            '二等奖_小米电源'=>['小米新款移动电源10000mAh 银色',1],
            '二等奖_小米手环'=>['小米手环',2],
            '三等奖_猪肉脯'=>['[百草味]靖江猪肉脯180g',1],
            '三等奖_碧根果'=>['[百草味] 奶香碧根果218g',1],
            '五等奖_旺仔牛奶苹果味'=>['旺旺 旺仔牛奶 苹果 (铁罐装) 245ml',3],
            '五等奖_饭票'=>['儒林餐厅餐票',20],
            'Thanks'=>['谢谢参与',1000000000]

        ];







        # award create
        foreach($lottery as $key=>$award){
            Award::create([
                'name' => $award[0],
                'image_path' => 'imgs/goods/'.$key.'.jpg'
            ]);
        }


        #lottery
        foreach(range(1,7) as $index){
            //$award = Award::find($index);
            $lottery = Lottery::create([
                'award_id' => $index,
                'prob' => $index * 10,
                'number' => 10,
            ]);
        }

        # goods create
        foreach($goods as $key=>$goods){
            Goods::create([
                'name' => $goods[0],
                'number' => $goods[1],
                'points' => $goods[2],
                'available'=>true,
                'image_path'=>'imgs/goods/'.$key.'.jpg'
            ]);
        }

        #biglottery create
        foreach($biglottery as $key=>$lottery){

            \App\BigLottery::create([
                'name'=>$lottery[0],
                'sum'=>$lottery[1],
                'current'=>0,
                'remain'=>$lottery[1],
                'image_path'=>'imgs/goods/'.$key.'.jpg'
            ]);
        }


    }
}
